app/controllers/todos_controller.rb

SELECT "todos".* FROM "todos"  WHERE "todos"."user_id" = 2 AND "todos"."done" = 'f'
---
  def index
    @todos = current_user.todos.where(done: false)

INSERT INTO "todos" ("created_at", "done", "name", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-09-09 15:05:46.764157"], ["done", "f"], ["name", "test"], ["updated_at", "2014-09-09 15:05:46.764157"], ["user_id", 1]]
---
  def create
    @todo = current_user.todos.new(todo_params)
    if @todo.save

SELECT  "todos".* FROM "todos"  WHERE "todos"."user_id" = ? AND "todos"."id" = ? LIMIT 1  [["user_id", 1], ["id", 136]]
---
  def edit
    @todo = current_user.todos.find(params[:id])

SELECT  "todos".* FROM "todos"  WHERE "todos"."user_id" = ? AND "todos"."id" = ? LIMIT 1  [["user_id", 1], ["id", 135]]
UPDATE "todos" SET "done" = ?, "updated_at" = ? WHERE "todos"."id" = 74  [["done", "t"], ["updated_at", "2014-08-26 20:00:43.625675"]]
---
  def complete
    @todo = current_user.todos.find(params[:id])
    @todo.update_attribute(:done, true)

SELECT  "todos".* FROM "todos"  WHERE "todos"."user_id" = ? AND "todos"."id" = ? LIMIT 1  [["user_id", 17], ["id", 142]]
UPDATE "todos" SET "name" = ?, "updated_at" = ? WHERE "todos"."id" = 52  [["name", "qwerweree"], ["updated_at", "2014-08-26 08:36:46.415481"]]
---
  def update
    @todo = current_user.todos.find(params[:id])
    if @todo.update(todo_params)

SELECT  "todos".* FROM "todos"  WHERE "todos"."user_id" = ? AND "todos"."id" = ? LIMIT 1  [["user_id", 1], ["id", 135]]
DELETE FROM "todos" WHERE "todos"."id" = ?  [["id", 9]]
---
  def destroy
    @todo = current_user.todos.find(params[:id])
    @todo.destroy